# 기타 메서드 (drop,shift,rename)

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### drop
- 특정 행, 컬럼 제거
- 이름 전달

In [2]:
emp = pd.read_csv('C:/Users/ZenBook/Desktop/냇물이/교육/code/data/emp.csv')
emp

   empno  ename  deptno   sal
0      1  smith      10  4000
1      2  allen      10  4500
2      3   ford      20  4300
3      4  grace      10  4200
4      5  scott      30  4100
5      6   king      20  4000

- scott 퇴사

In [3]:
emp.loc[emp['ename'] == 'scott']  #scott 관련 record

   empno  ename  deptno   sal
4      5  scott      30  4100

In [4]:
emp['ename'] == 'scott'  #조건문

0    False
1    False
2    False
3    False
4     True
5    False
Name: ename, dtype: bool

In [5]:
emp.loc[~(emp['ename'] == 'scott'),:]  #scott 퇴사

   empno  ename  deptno   sal
0      1  smith      10  4000
1      2  allen      10  4500
2      3   ford      20  4300
3      4  grace      10  4200
5      6   king      20  4000

In [6]:
emp.drop(4, axis=0)
# 행 기준으로 네번째 인덱스 제거

   empno  ename  deptno   sal
0      1  smith      10  4000
1      2  allen      10  4500
2      3   ford      20  4300
3      4  grace      10  4200
5      6   king      20  4000

- sal 컬럼 제외 (iloc 이용)

In [7]:
emp.iloc[:,0:3]

   empno  ename  deptno
0      1  smith      10
1      2  allen      10
2      3   ford      20
3      4  grace      10
4      5  scott      30
5      6   king      20

In [8]:
emp.iloc[:,:-1]

   empno  ename  deptno
0      1  smith      10
1      2  allen      10
2      3   ford      20
3      4  grace      10
4      5  scott      30
5      6   king      20

In [9]:
emp.loc[:,"empno":"deptno"]

   empno  ename  deptno
0      1  smith      10
1      2  allen      10
2      3   ford      20
3      4  grace      10
4      5  scott      30
5      6   king      20

In [10]:
emp.drop(['ename','deptno'], axis = 1) #sal만

   empno   sal
0      1  4000
1      2  4500
2      3  4300
3      4  4200
4      5  4100
5      6  4000

### shift
- 행 또는 열 이동
- 전일자 대비 증감율

In [12]:
emp['sal'].shift()  #default: axis=0

0       NaN
1    4000.0
2    4500.0
3    4300.0
4    4200.0
5    4100.0
Name: sal, dtype: float64

- 전일자 대비 증감율 출력하기

In [14]:
s1 = Series([3000,3500,4200,2800,3600], 
       index = ['2021/01/01','2021/01/02','2021/01/03','2021/01/04','2021/01/05'])
s1

2021/01/01    3000
2021/01/02    3500
2021/01/03    4200
2021/01/04    2800
2021/01/05    3600
dtype: int64

In [15]:
# 1월 2일의 증감율은? >> (3500-3000)/3000
s1.shift()

2021/01/01       NaN
2021/01/02    3000.0
2021/01/03    3500.0
2021/01/04    4200.0
2021/01/05    2800.0
dtype: float64

In [16]:
(s1-s1.shift())/s1.shift() * 100

2021/01/01          NaN
2021/01/02    16.666667
2021/01/03    20.000000
2021/01/04   -33.333333
2021/01/05    28.571429
dtype: float64

### rename
- 행, 컬럼명 변경
- {}이용, 컬럼 위치 등 모두 변경이 가능

In [17]:
emp.columns = ['empno','ename','deptno','salary']
emp

   empno  ename  deptno  salary
0      1  smith      10    4000
1      2  allen      10    4500
2      3   ford      20    4300
3      4  grace      10    4200
4      5  scott      30    4100
5      6   king      20    4000

In [18]:
emp.rename({'salary': 'sal', 'deptno': 'dept_no'}, axis = 1)

   empno  ename  dept_no   sal
0      1  smith       10  4000
1      2  allen       10  4500
2      3   ford       20  4300
3      4  grace       10  4200
4      5  scott       30  4100
5      6   king       20  4000

- emp 데이터에서 ename을 index로 설정 후 scott을 SCOTT 변경

In [21]:
emp.set_index('ename').rename({'scott':'SCOTT'})

       empno  deptno  salary
ename
smith      1      10    4000
allen      2      10    4500
ford       3      20    4300
grace      4      10    4200
SCOTT      5      30    4100
king       6      20    4000

In [23]:
emp.index = emp['ename']

In [24]:
emp.rename({'scott':'SCOTT'})

       empno  ename  deptno  salary
ename
smith      1  smith      10    4000
allen      2  allen      10    4500
ford       3   ford      20    4300
grace      4  grace      10    4200
SCOTT      5  scott      30    4100
king       6   king      20    4000